# 1. Базовый образ: Официальный образ Python 3
FROM python:3.11-slim

# 2. Устанавливаем переменные окружения для Python, чтобы он не создавал лишние файлы и не буферизизовал вывод
ENV PYTHONDONTWRITEBYTECODE=1
ENV PYTHONUNBUFFERED=1

# 3. Задаем рабучую дерикторию внутри контейнера. Все дальнейшие инструкции будут выполняться здесь.
WORKDIR /app

# 4. Копируем файл с зависимостями в контейнер. Делаем это отдельно до копирования всего кода, чтобы использовать кэшировние Docker.
COPY requirements.txt .

# 5. Устранавливаем зависимости.
RUN pip install --no-cache-dir -r requirements.txt

# 6. Копируем весь остальной код проекта в контейнер.
COPY . .

# 7. Указываем, что контейнер будет слушать порт 5000 (порт, который использует Flask).
EXPOSE 5000

# 8. Команда для запуска приложения при старте контейнера.
CMD ["python", "app.py"]